Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 여장 대회 하나 하는데 그렇게 의상 대여를 하냐?
en: who rents an entire outfit just for a cross-dressing competition?

source: 두웅
en: DUN

source: …갑작스럽지만 얼굴도 잘생겼고…
en: it’s sudden... but he’s cute...

source: 그건 나도 알아…
en: I know...

source: 아냐… 난 그런 거…
en: no... I don’t want--

source: 아~ㅎㅎ 그런건 아니고
en: oh, haha. no.

source: 양말 못찾았어?
en: you couldn’t find your socks?

source: 혹시 괜찮으면…!
en: would you...

source: 운명을 거스르지 않고 본분을 다한다면
en: if you fulfill all your duties without defying fate,

source: 같.은.부에서 만나 연애…?
en: dating... in the same club?

source: 뭐…?{j}ㅆ발..?
en: f*cking what?{j}

source: 진주가 썽을 내길래 대신 찾으러 왔지~ 오늘이 진주 생일인 것도 까먹은 건 아니지?
en: pearl’s really riled up. you didn’t forget that it’s her birthday, too... right?

source: 미안해, 신아
en: sorry, shin...

source: 대화만 막는 정도가 아니라, 진짜 알고 데려가는 것처럼 보여야 하니까.
en: it needed to look like we knew that he was coming for you.

source: 여자를 못 사귀고 죽은 한이 가득 맺혔구나!!
en: you died full of grudges because you never had a girlfriend!!!

source: 말도 안돼.
en: no way...

source: 이게 얼마나 멋진 일이야
en: how beautiful is that?

source: 들어주니까 어디까지 가?
en: how far do you plan to take this?

source: 너의 고민이 장난같았으면
en: if I thought of your concern as only a joke...

source: 나랑 가는 사람 둘 다 기억을 못 하는 거야.
en: ...but neither I nor the other person will remember.

source: 결계?!
en: a trap?!

source: 너무 걱정하지 마.
en: don’t worry about it too much.

source: 여의주 이젠 너도봤지?
en: euijoo, you saw, right?

source: 미안 ㅎㅎ
en: I do, haha.

source: 그냥 보고있을 수가 없었어…
en: I couldn’t just ignore it.

source: 꽈드득
en: GRIP

source: 그렇다면!!
en: then-!!

source: 아빠를 항상 보고 싶었는데…
en: I’ve always missed you, dad...

source: 그리고 걔 전에 나한테 막말한 거 미안해서 도와준 거니까,
en: the ghost helped because she was sorry about saying such mean things to me back then.

source: 미국에 가신 거 아니야?
en: maybe he went overseas.

source: 아플거다…
en: it has to hurt...

source: 그, 그렇지만 어떻게…
en: b-but how...

source: 답은 계약 연애다-!!
en: a contract relationship!!!

source: 왜 항상…!
en: why?! every time-!

source: 얼른 찾으러 가자!
en: let’s go find him!

source: 널 이해해 줄 수 있는 사람도 만날 수 있을 거란다
en: ...you’ll meet someone who can understand you.

source: 귀기가 득하더라니…
en: ghastly energy at school.

source: 너, 마음 읽을줄 알지.
en: you can read minds, right?

source: 쌤 쇄골에 살짝 분홍색이 보이네요
en: teacher, I see a bit of pink on your collarbone.

source: ㅎ…
en: ha...

source: 최근에 컨디션 안 좋아 보인다고
en: tell her she doesn’t seem to be in the best condition recently.

source: 4 미술 체육 영어 수학 과학
en: 4 Art PE English Math Science

source: 안돼…!
en: no!

source: 김영준이야 ㅆ발놈아
en: it’s youngjun, you f*cker.

source: 하, 헛소리 하지 마.
en: ha! quit the nonsense.

source: 뭐, 뭔데?
en: o-of what?

source: 이만큼?
en: all this?

source: 크게는 안 다친 것 같-
en: I don’t think I got hurt badl--

source: 너 재밌자고 그러지 좀 마
en: stop kidding around only to have fun.

source: 진주 시작한다!!
en: it’s pearl’s turn!

source: 이대로 보내도 되는건가…?
en: will she be all right like this?

source: 씨ㅂ…!
en: f*ck!

source: 그 일상은…
en: but that ordinary life...

source: 그럼 됐다~ 우리 둘 다 착각이었나 봐~!
en: okay, then! we must have thought too much into it!

source: 너희 아버지는 그렇게 착한 분이셨나 봐
en: your father must have been a very kind person...

source: 그러고 보니 5반에 이상한 애가 있다고 들은 것 같기도…
en: then again, I did hear of a weird kid in class five...

source: 나 오늘 심지어 생일인데??
en: and it’s my birthday too!!!

source: 사랑과 일은 별개
en: love and work are two separate things.

source: 방금… 뭐라고?
en: what did... she just say?

source: 진-지
en: SERIOUS

source: 해림아-!!
en: haerim!!!

source: 그..
en: and...

source: 아니, 저 자는 동안 맘대로 정한 거잖아요;;;
en: but... you put me in a random one while I was sleeping...

source: 손바닥 까졌잖아!!
en: your hand!!!

source: 미정아, 괜찮아?
en: mijung, are you okay?

source: 아이들을 위한
en: ...a school for children...

source: 아, 미정~ 지금 매점 가려는데 같이 갈래?
en: hi, mijung! I’m going to the convenience store right now. wanna come with?

source: 뭔가 수상한 느낌이 든단 말이야
en: ‘cause I feel something strange...

source: … 아니잖아
en: she isn’t...

source: 차라리 내가 심리를 볼 수 있었다면…
en: I wish I could read minds...

source: 내 사회적 존엄성을 지킬 수 있어…!
en: to protect my place in society!

source: 어…어?!
en: uh... what?!

source: 6 체육 수학 음악
en: 6 PE Math Music

source: 퍼억
en: THWACK

source: 아니지 지금은 그보다…
en: wait a minute. that’s not important right now.

source: 그래…!
en: that’s right!

source: 소름끼쳐…
en: you freak me out.

source: 이게 말이 되는 몸매냐…!!
en: how is such a perfect figure even possible?!

source: 미∙∙∙ 미정아∙∙∙ ∙∙∙ .
en: mi-mijung...

source: 당장 얘한테서 떨어져.
en: get away from her this instant.

source: 계획은 거의 찬규가 짠 거기도 하고.
en: and chankyu’s the one who planned most of this.

source: 싱긋
en: SMILE

source: 무의식적으로 생각했어
en: ...in that fleeting moment.

source: 어떤 변태가 훔쳤나?
en: did some pervert steal them?

source: 그러니까 이러고 있지…
en: yeah, that’s why I’m like this right now...

source: 그거 이번 축제 여장 남자 대회에서 입힐 소품이야!
en: those are a special pair to put on the boy that’s going to dress as a girl!

source: 엿이나 처먹으라고 할 줄
en: I thought you’d tell her to bug off.

source: 막막하구먼
en: we’re in trouble.

source: 너한테 다른 기회는 없어…
en: no more chances for you...

source: 이게 당첨이야!
en: this will win the prize!

source: 지금 당장 구급차 불러-!!
en: call an ambulance immediately!!!

source: 무슨 소리야?
en: what are you talking about?

source: 냄새를 왜 맡아 병X들아
en: why sniff those, you morons?

source: 아…씨
en: ugh, d*mnit...

source: 뭐야, 나 아직 아무 말도…
en: what the- I didn’t even say anything yet.

source: 어어?
en: oh?

source: 여의주, 내가 보기엔 이신은 네가 생각하는 그런 놈은 아니니까
en: euijoo. the way I see it, shin isn’t as nice as you think.

source: 오늘 시합도 이겼으면서 무슨 스트레스??
en: you won your tournament today.

source: 멈춰 미친새끼야
en: shut your traps, you morons!

source: 나는 전쟁 후 부상당한 사람들을 치료하는 간호사가 되었다
en: I became a nurse and treated the injured even after the war.

source: 으아아악!!
en: ooowww!!!

source: 바로 이거야-!!!
en: this is exactly what I wanted!!!

source: 어떡해!
en: what should we do?!

source: 헉 진심이다!!
en: sh*t, she’s serious!!!

source: ㅋㅋㅋ 이제 기억났어?
en: now you remember? hahaha.

source: 목적이 뭐야 씨ㅂ아
en: what are you up to, you f*cker?

source: 학급신문
en: Bulletin Board

source: 이…이게 되네?!
en: th-this... worked?!

source: 그래 쓰레기 치운다 ㅆ발..!
en: yeah, I’m picking up trash, you f*cking-!

source: 아악~ 그니까~ 의상 대여비 물어줘야 하면 어떡해~!
en: ughhh! exactly! what if we have to pay extra for losing them?

source: 친구인데, 그 정도도 못할까 봐?
en: I’m willing to help my friend!

source: 갑자기 미래가 너무 뚜렷하게 보여…!
en: ...the future! I see it so clearly all of a sudden!

source: 나중에 까톡 해 찍어줄게ㅎㅎ
en: send me a text later! hehe.

source: 왜!{j}왜!{j}뭔데!!
en: wh-why?! what is it?!{j}{j}

source: 시체조차 못 찾은 채로…?
en: without even recovering his body?

source: 이 새끼랑 언제 떨어지지…?
en: how can I lose him?

source: 태희한테 있는데
en: ...is stuck on taehee?

source: 장난같이 굴어서 잘 가…
en: ...for acting like it was a joke. bye.

source: 별스타 올릴 사진 개마니 찍자~!
en: let’s take tons of pics to post on instargram!

source: 또….
en: what if...

source: 이 미친놈이 또!!
en: this bastard’s at it again!

source: 내가 죽은 주제에 계속 미련만 남아서 이러는 거 성가신 거 알아
en: I know I’m being annoying by holding onto my regrets even though I’ve already died.

source: 약속 까먹은 거 아니지?
en: you didn’t forget your promise, right?

source: 3 미술 과(학)
en: 3 Art Sci

source: 굳이 진주가 아니라 쟤가 왔는지는 모르겠지만…
en: I wonder why he came here instead of pearl...

source: 어 ^^ 이따 봐~
en: mm-hm! see you!

source: 그럴 수가!!
en: no way!

source: 아…!
en: ah-!

source: 그러고 보니까 생각이 잘 안 들려져서 기분이 이상했어
en: come to think of it, I did feel a bit off because I couldn’t hear other peoples’ thoughts.

source: 어??
en: huh?!

source: 그래 귀신 너는 늙었으니까^^
en: okay, ghost. I understand. you’re old.

source: 그, 그리고 네 말대로라면 내가 아니라 내 영력 같은 게 좋다는 거 아니냐고?
en: a-and if what you said is true, then you must like my spiritual energy! not me!!!

source: 도서관 가는데 뭘 꾸민다고 내가.
en: why would I dress up to go to the library?

source: ㅎㅎ다행이다, 금방 잡았네요
en: hehe, I’m glad I caught up to you so fast!

source: 걔가..?
en: really?!!!

source: 안녕…
en: bye.

source: 그러니까 찬규님
en: so master chankyu,

source: 아까 나갔는데?
en: she went out just now.

source: 그래… 괜찮을 거야
en: yeah... she’ll be fine.

source: …좋네요
en: that’s great...

source: 물러나라아앗!
en: be gooone!

source: 되겠냐?
en: it’ll never work!

source: 그냥 소녀 모습해라…
en: just go back to being the little girl...

source: 야!
en: chankyu!

source: 하다못해 시체만이라도… 찾을 수 있다면…
en: if only I could find at least his body...

source: 아까랑 똑같잖아…
en: that’s what she said...

source: 하 ㅋ 말하는 거 봐 네가 어떻게 상담을 한다는 거야?
en: ha! how can you counsel anyone with that attitude?

source: 그럼 뭐해…
en: all that, for what?

source: 짹짹쨱
en: CHIRP CHIRP CHIRP

source: 곧 축제라서 5교시는
en: the festival is coming up, so during fifth period,

source: 2 수학 사회 국어 가정 영어
en: 2 Math Society Korean Home Ec English

source: 척
en: FLICK

source: 나는 전혀 몰랐지… 이 핑크색 뭉치가…
en: I had no idea that this pink bundle...

source: 우릴 용서해 줘
en: ...please forgive us.

source: 뭐여
en: what the...

source: 떠올려라!X2
en: ...of your father again!

source: 왜 그래??
en: what’s wrong?!

source: 그래…!!
en: that’s it!!!

source: ㅜㅜ 그럼 이따 봐~
en: okay, then. see you later!

source: 진주 괜찮아?ㅠ
en: pearl, are you okay?!

source: 도망치지 마
en: so don’t run from me.

source: 아뇨…
en: no, master...

source: 플래카드 셔틀 해줄 친구도 데리고 갈 거야!
en: I know a loser who can carry them for me!

source: 그러게
en: you’re right...

source: 운동화 신으면 찝찝하겠다
en: it’ll be uncomfortable wearing your sneakers barefoot.

source: 호기심이 있는 거야 그렇지?
en: you’re just curious, aren’t you?

source: 잼 까먹었다!
en: I forgot the jam!

source: 짹 짹 짹
en: CHIRP CHIRP CHIRP

source: 아… 그, 그래..
en: oh... o-okay...

source: 왜저래…
en: what the hell are they doing...?

source: 왜 하필!!
en: why, of all times!!!

source: 뭐.
en: ha.

source: 아니냐?
en: aren’t you?

source: 아, 태남이 하이!
en: oh, hi taenam!

source: 오늘 팬티 무슨 색?!
en: what color is your underwear today?

source: 그렇게 된 거예요 ///
en: that’s what happened!

source: 난 뭐라고 해줘야 할지 모르겠는데…
en: I have no idea how to comfort her...

source: …그래?
en: really?

source: 최면이 설마 아직도 안 풀린 거야…?!
en: is she still under my hypnosis?!

source: 엄마랑 나, 아빠… 셋이서 늘 평화롭던 일상…
en: my mom, my dad, and I lived ordinary lives together.

source: 김찬규 못 만날건 뭐야
en: how is chankyu any worse than you are?

source: 지금은… 어떤데?
en: what about... now?

source: 용의 눈.
en: its eyes.

source: 니들은 꺼져!!
en: back off! all of you!!!

source: 너랑 계약연애하기엔 찬규님이 아까워!
en: my master chankyu deserves so much better than you! even if this is a fake contract!

source: 내가 분명히 그딴 거 안 한다고 했잖아
en: I clearly said I don’t want that kind of relationship.

source: 언제부턴가 학교에서
en: at some point, I began sensing...

source: 스피커 옮겨야 하는데 내 정신 좀 봐
en: I have to take the speaker there right now.

source: 시험기간을 게임이벤트마냥 생각하고 있지마라.
en: don’t think of finals week as a mere game event.

source: 빨리 말해!!
en: hurry up and explain!!!

source: 찬규~~?
en: chankyu?

source: 얘들아~ 혹시 의주 못 봤어?
en: hey, guys. have you seen euijoo?

source: 꺅
en: aaack!

source: 어쨌든 난 손 뗄 거야
en: in any case, I’m not getting involved.

source: 이 학교…?
en: this... school?

source: 사귀는 사이엔 보통 사귀어 준다는 표현 같은 거 하지 않아
en: obliged? that isn’t something a boyfriend would normally say.

source: 아오 뭐라는 거야 또…
en: what’s that loser saying now?

source: 어, 이미진 저기 있네
en: oh, there’s mijin.

source: 언제든 날 알아보도록
en: so he can recognize me.

source: 진짜 좀 달달하니까 더 맛있…!
en: it’s sweeter, so it really does tastes bet...

source: 하하 그래도 곤란해 보이는 걸 어떡하니
en: haha, I couldn’t ignore someone who seemed to be in trouble.

source: 뭐야~~ 그럼 네가 주운 거였구나!
en: really? so you picked them up!

source: 너 의주 옆에 따라다니는 걔구나.
en: you’re the kid that follows euijoo around.

source: 너부터 없애야겠지?
en: I should get rid of you first.

source: 고마워, 그래도 너무 그러진 말고…
en: thanks. can you also...

source: 이 학교 아래 묻혔으니까
en: he’s buried under this school.

source: 그거 제가 한거 아닌데?
en: that wasn’t me...

source: 축제 때 안 쓰는 교실도 정리하기로 했잖아
en: we agreed to clean up the empty classrooms during the festival, remember?

source: 무슨 일인데, 얘기나 해봐.
en: what is it? tell me.

source: 그렇게 됐으니까 우리 데이트라도 하러 가자~
en: anyway, that’s what happened. chankyu, let’s go out on a date!

source: 그럼 어쩔 수 없지 괜찮아~
en: oh well, then. it’s all right.

source: … 하아…
en: hah...

source: 귀신?!
en: a ghost?!

source: 좀 해∙∙∙ ∙∙∙ .
en: you don’t have any choice but to rely on them...

source: 그래서 더 친절하고 상냥하게 굴고
en: the kinder and friendlier I was...

source: 무엇보다 당신이 가진 영력은 일반인의 영력의 수준이 아니에요
en: above all, your spiritual energy is far more powerful than any ordinary person’s, master.

source: 뒷정리 담당인데 뭐지 김우찬… 어디 갔냐?
en: woochan’s supposed to help clean up... where’d he go?

source: 진주랑 약속…?
en: my promise... with pearl?

source: 그냥 고르면 안 돼?ㅠ
en: can’t we just pick anything?

source: 흐윽
en: sniffle...

source: 그냥 나 좋다는 사람들이 대체 무슨 마음인지 궁금했어
en: I was just curious about the kids who liked me... about what they must be feeling.

source: 진짜 다행이다!
en: anyway, it’s a huge relief!

source: 처음부터 연애 고민도 아니었으면서…
en: if you didn’t even want to date to begin with...

source: 좀 좋은 향기도 나고…
en: ...kind of smells nice.

source: 꼭 저렇게 성적은 신경 쓰면서 일진 같은 애들이 있지… ㅅㅂ
en: I hate the types that care tons about their grades but still act like bullies... f*ck.

source: 대충 치우고 나가야…
en: let’s just get this done quick...

source: 좀 씹덕같…
en: that sounds absurd...

source: 죽기 싫어
en: “I don’t want to die!”

source: 나도 의주처럼 생각을 읽을 수 있었으면 좋았을 걸 그랬다…
en: I wish I could read minds like euijoo can...

source: 그… 혹시나 해서 말해두는 건데 여기는 지금 202X 년이야
en: mmm... just in case you didn’t know, it’s the 21st century right now.

source: 아직도 널 주인님으로 모시는 최면에 걸려있다고??
en: is still under hypnosis? and serving you as her master?

source: 히히…
en: hehe...

source: 나도 진주랑 좀 이야기해볼게
en: I’ll try talking to pearl about it.

source: 좀 잘 알아보는 게 좋을 것 같다
en: but I think you should look into shin a bit more.

source: 우리 같은 사람에게는 우리의 세계가 있는 거야
en: people like us live in our own world.

source: 아 뭐냐고.
en: ugh, what is it?!

source: 아, 돌아온 건가…?!
en: oh, did I come back-?!

source: ∙∙∙ ∙∙∙ 야, 잠깐만
en: hey... wait.

source: 이런 경우는 처음이야…!
en: I’ve never felt anything like this before!

source: 손도 덥석 잡고… 말도 잘하고…
en: no qualms about holding my hand or talking to me...

source: 접근 하지 마 이기 주의자!!
en: don’t come near him, you selfish brat!!!

source: 내 생명의 은인이니까…
en: because... she saved my life.

source: 우리 아버지는 남북전쟁…
en: my father passed away...

source: 수학
en: Math

source: 우뚝
en: HALT

source: 나 방송댄스 동아리라서 이따가 무대하거든!
en: I’m in the dance club, so I’ll be on stage later today!

source: 그럼 너네 죽음도 그렇게 받아들여 봐
en: then consider your deaths the same too.

source: 아… ㅆ발…
en: oh... f*ck...

source: 몇 번을 반복해도 우린 어떻게든 이 상황을 만들거야.
en: no matter how many times we repeat it, we’ll recreate this situation again and again.

source: 난 이제 죽는 거구나 차에 치여서… 이렇게…
en: I guess I’m dying now... like this... hit by a car...

source: 뒈져버려
en: to hell, rather!

source: 체육
en: PE

source: 어디서 어떻게 돌아가신지 알아야 찾지…
en: you need to know where and how he died to find it...

source: 야 됐으니까
en: hey, you.

source: 부탁할게
en: I’ll leave it to you, then.

source: 눈에는 눈, 이에는 이
en: an eye for an eye, a tooth for a tooth...

source: 그건 아니잖아.
en: you know that isn’t true.

source: 어, 맞아!ㅎ
en: yeah, that’s her!

source: 박수, 박수!!
en: hurry and clap!

source: 그걸 누구 맘대로 정했어?
en: who decided that?

source: 3 미술 과학 도덕 국어 수학
en: 3 Art Science Ethics Korean Math

source: 아직 체육관에!
en: she’s still at the gym!

source: …너 어떻게 한 거야?
en: how... did you do that?

source: 할 일 없는 건 사실이잖어ㅎㅎ
en: isn’t it true that you have nothing to do?

source: 떠올려라!
en: ...your father!

source: 신이는 애가 원래 착해서그런가, 대단하네…
en: ...but shin knows exactly what to say. he’s so kind...

source: 또 도서관을∙∙∙ 이건 진짜다∙∙∙ ∙∙∙ .
en: the library again... what should I do...?

source: 딱… 들어만 본다
en: I’ll just... find out what he’s up to.

source: 의주도 응원해 주고 있고… 이신이도 평소처럼 와있어!
en: euijoo’s here cheering for me... and so is shin, like always!

source: 나는.
en: I’m taking my hands off.

source: 전부… 죽어버려라…
en: kill... them all...

source: 자, 오늘 한 데까지 시험 나온다~
en: everything we studied up to today will be on the exam.

source: 진짜 미안…
en: I’m really sorry...

source: 어, 어 그럴까?
en: uh... oh, okay!

source: 군번줄
en: the military tag?

source: 오!!
en: oooh!

source: 다음 시합에도 당연히 승리하겠지만 오늘도 이긴 진주를 위해서 내가 한턱 쏠게
en: I’m sure my pearl’s going to win every time, but since she won again today, let’s go eat something good! it’ll be on me.

source: 너의 죽음만 더 특별하다고 생각하지 마
en: stop thinking that your death is special.

source: 나도 슬슬 지쳐서지 내 의지로 돌리는 것도 아닌데 …
en: ...because I’m getting tired of this too. I didn’t want to do this in the first place...

source: 평소 같지 않아.
en: that wasn’t like me.

source: 어어∙∙∙ ∙∙∙ .
en: yeah...

source: 깨졌어?
en: you two broke up?

source: 잠깐 둘 다 진정해 봐…!
en: wait, wait. relax, both of you!

source: 아니, 갑자기 재채기가 나와서 ㅎㅎ
en: no, it was just a random sneeze.

source: 아니, 아니 애초에 왜 여기 있었냐고
en: no, no. I mean, why were you even here in the first place?

source: 약속을 까먹냐~!
en: how dare you forget!!!

source: 보는 눈이 많으니 일단…
en: a lot of people are watching, so for now...

source: 게다가 왠지 처연한 저 표정…!
en: and that sad look on his face...

source: 다음 주잖아.
en: they’re next week.

source: 마치 천년은 산 업보의 크기…
en: it’s almost like 1000-year-old karma!

source: 잉?
en: eh?

source: 야 김찬규 안 오고 뭐해
en: dude, chankyu, keep up, will you?

source: 신아, 너…
en: shin, you’re...

source: 잘 들어, 이신.
en: listen carefully, shin.

source: 대단한 일이란다
en: ...is a great deed.

source: ㅎㅎ 분홍색이 취향인가요?
en: hehe, you must really like pink, huh?

source: 그래?
en: really?

source: 이렇게 된 이상 강제로라도 능력을 폭주시켜주지!
en: now I have no choice but to force your super power to activate!

source: 안경 원숭이… 너 설마…
en: you four-eyed monkey... did you...

source: 아니야!!
en: no! that’s not true!!!

source: 50분남은 건 어떻게 알지?
en: how did he know there are 50 minutes left?

source: 호호호
en: HOHOHO

source: 그리고!
en: besides!

source: 어때?
en: what do you think?

source: 하여간 저것들이랑 얽혀서 좋은 일이 없다니까.
en: ugh... nothing good ever comes from being with them.

source: 너희 아버지가 언제 어디서 돌아가셨는지 알아?
en: do you know when and where your father passed away?

source: 5 영어 국어 음악
en: 5 English Korean Music

source: ㅆㅂ
en: dammit.

source: 참 좋았을 텐데…
en: it would have been so nice...

source: 들키면 50년 동안 놀림당하겠지…
en: if he finds out, he’ll tease me for 50 entire years...

source: 먹혀라!
en: please work!

source: 대박~
en: wow, that’s amazing!

source: 찬규야 너라면 할 수 있어…!!
en: chankyu, I believe in you! you can do it!!!

source: 물론 확률은 0.02%다
en: though there’s only a 0.02% chance of success.

source: 해림이 여신이다!!
en: haerim! you’re a goddess!!!

source: 아버지를 찾고 있어
en: ...searching for my father.

source: 그리고 찬규님은 저랑…♥
en: which means, master chankyu, you can be with me!

source: 도와줄 테니까 빨리 찾고 성불해버려라
en: we’ll help, so find him fast and just go to heaven.

source: 누구 맘대로 도와줘.
en: you can’t help her.

source: 어디 가?
en: where are you going?

source: 너… 어떻게?!
en: how... did you...?!

source: 뭔데?
en: what’s wrong?

source: 슈우욱
en: WHOOSH

source: 아니 딱히.
en: not really.

source: ㄹㅇ 봄이야 겨울이야
en: yeah, right? did it spring back to winter or what?

source: 엇, 넌??
en: huh? what about you?

source: 중지-!!
en: time out!!!

source: 그럼… 하나만 확인해 봐도 될까?
en: then... can I just check one thing?

source: 미안해!
en: sorry!

source: 너희 학교에서 발견된 거 아니니?
en: wasn’t it discovered at your school?

source: 어,어-?
en: h-huh?

source: 아무것도 모르면서…
en: you don’t even know anything...

source: 이건…?
en: what’s this...?

source: 그랬다간 또 너만 힘들게 될 뿐이야
en: then it’ll only be more difficult for you.

source: 회귀의 횟수가 많아서 이런 영력이 가능했군요
en: your spiritual energy must be a result of going back in time so many times.

source: 수련회 때 유일하게 최면에 걸렸던 게
en: the only hypnosis that worked at the retreat...

source: 내일도 데리러 갈게
en: I’ll pick you up tomorrow.

source: 묻는 말에 대답이나 해.
en: just answer my question.

source: 그 무당집 딸?
en: the shaman’s daughter?

source: 아, 아니!! ////
en: n-no!!!

source: 알림 1
en: Notice 1

source: 닥쳐!
en: enough!

source: 차, 찬규…!
en: ch-chan...kyu!

source: 알 수 있었으면서 난…
en: I could’ve known sooner, but...

source: 아버지를
en: ...think of...

source: 이 느낌은…?
en: this feeling?

source: 어머…!
en: oh no!

source: 주인님으로 모셔라
en: ...serve me as your master.

source: 저런 미친놈…
en: that moron...

source: 다행이다 가까워서!!
en: how fortunate that he’s so close!!!

source: 허억...헉..
en: huff... huff...

source: 슬쩍 자리에 가져다 놓자…!!
en: ...and leave them on the owner’s desk!!!

source: 사람을 돕는 건
en: helping people...

source: 하… 그래.
en: ha... fine.

source: 뭐지 저건?
en: what’s that?

source: 으응…
en: yeah...

source: 공과 사는 구분해야지 그리고 너희
en: there are rules I can’t break. and...

source: 아까 그 이상한 짓은 그렇다 쳐도…
en: despite his weird actions earlier...

source: 얌전한 고양이가 부뚜막 올라가네ㅎ
en: so you aren’t that innocent after all, hehe.

source: 아빠를 마지막으로 봤을 때,
en: the last time I saw my dad...

source: 뭐야!
en: what the-!

source: 팍씨!{j}정신 차려라
en: ha! keep your head on straight, fool.{j}

source: 빨리 찾아야지
en: let’s find him quickly.

source: 너무…
en: you’re too...

source: 답답할 수 있겠지만 꼭 기억하렴
en: it can be frustrating at times, but remember this.

source: 너 왜 여깄어!!
en: what are you doing here?!

source: 아냐, 무시해 그딴…
en: no way. you can just ignore it all...

source: 아니 팩트잖아..
en: no, it’s the truth.

source: 헉!!!맞다!!
en: oooh, right!!! sh*t!!!

source: 친구로서 내가 할 수 있는 건 없는 거야…?
en: ...that means there isn’t anything else I can do as her friend...

source: 저, 저기…
en: uh... everyone...

source: 응… 네꺼인지 몰랐지…
en: yeah... I didn’t know they were yours...

source: 지금?!
en: really?!

source: 그니까 다치지 마!!
en: so, don’t get hurt!!!

source: 팩트 폭행일 수도 있구…
en: what she said might be the brutal truth...

source: 그래서 능력자들은 필연적으로 여의주의 곁으로 모이게 되는 거죠
en: so those with superpowers have no choice but to gather around euijoo yeo*. *yeo-euijoo: a magic pearl that is said to have the ability to grant wishes

source: 이대로 죽을 수는 없어…
en: I can’t just die like this...

source: 무슨 말이 하고 싶은 거야?
en: what are you trying to say?

source: 단지 영력을 흡수하려는 기생충이잖아
en: you’re just a parasite that wants her spiritual energy!

source: 뭐지?
en: what is...

source: 그랬었는데…
en: or so I thought.

source: 아… 그래…
en: oh... I see...

source: 어떻게 주는데?
en: how do I give it to you?

source: 얼굴이나 치워
en: move your face out of the way.

source: 왜 아무 일도 없는 거지?
en: why did nothing happen?

source: 그래서…
en: so...

source: 아까 죽음은 다 똑같다고 했지
en: you said all deaths are the same, right?

source: 거스를 수 없는 운명처럼
en: fate cannot be defied.

source: 여자는??
en: what about a girl?

source: 수련회에서 내가 너한테 한말 기억나?
en: remember what I told you at the retreat?

source: 진주 남친…?
en: pearl’s boyfriend...?

source: 친구들이랑 안 가봐도 돼?
en: you sure you don’t want to go with your friends?

source: 혼자 뭔 쌩쇼하길래 지나가려다 말해준다
en: I’m just saying this because I noticed you getting worked up by yourself while passing by.

source: 찬규님~!
en: master chankyuuu!!!

source: 아… 미안… 나 같이 다닐 친구가 있어서!
en: oh, sorry... I’m hanging out with another friend!

source: 그렇다면 이 니삭스의…!
en: that means these knee socks are--

source: 정아 선배한테 혼나겠다
en: jung-ah’s going to kill me.

source: 그럼 또 애들이 좋아하고
en: ...the more everyone liked me.

source: 내 영력을 나눠주면 깨어날 거야!!
en: then she should wake up if I give her some of mine!!!

source: 아야얏…
en: ouch...

source: 그 자식… 능력은!{j}능력증폭이 아니야…!!
en: it’s because... his super power isn’t amplifying other powers!!!{j}

source: 네가 뒤져야 깔끔한데 뭐 하는 짓이야?
en: you have to disappear for this to end completely. what the hell are you doing?

source: 단발에 눈 밑에 점이 있는 애 맞아?
en: ...the girl with short hair and a mole under her eye?

source: 저번엔 까먹었다고 난리치더니∙∙∙ ∙∙∙ .
en: you made such a fuss that you forgot last time.

source: 근데 왜 이렇게까지 하는 거야?
en: but why are you taking it this far?

source: 니가 어떻게 나올지는 아는 게 당연하지
en: it’s only natural that I know your next move.

source: 안그래도 그게 좀 걸렸었는데…
en: that’s been bothering me, actually...

source: …!!{j}소, 손은 갑자기 왜 잡고 난리냐!!
en: wh-why are you suddenly grabbing my hand?!{j}

source: 교복 입어.{j}그냥 교복.
en: wear your school uniform.{j}

source: 미친…
en: dammit...

source: 지금… 빈틈…!!
en: she... has a weak spot!!!

source: 털썩
en: PLOP

source: 운명적인 만남?
en: a fateful encounter?

source: 엇 그게…
en: uh, well...

source: 사랑보다 우정인 남자-!!
en: friendship over love, huh?

source: 그냥…
en: I just...
